sdaiIsInstanceOf(Sdai_instS*,Sdai_instS*)
\details
Determines whether an application instance is an instance of a specified type.
\param instance [in] An application instance to be checked.
\param entity   [in] An entity that represents the type.
\returns sdaiTRUE if the application instance is an instance of the specified type; otherwise, the function returns sdaiFALSE.